schmmd/soleCAN/embedded/esp32-s3/src/main.cpp
    // Per-cell arrays (20 voltages, 7 temperatures; null if not yet received).
    // Emitted in the minimal/BLE payload too so the cell-detail view works over
    // Bluetooth as well as WiFi; costs ~200 B (a couple more BLE chunks).
    {
        auto cells = cells_obj["voltages"].to<JsonArray>();
        for (int i = 0; i < NUM_CELLS; i++) {
            if (!isnan(g_cell_v[i]))
                cells.add(roundf(g_cell_v[i] * 1000.0f) / 1000.0f);
            else
                cells.add(nullptr);
        }
        auto temps = cells_obj["temp_readings"].to<JsonArray>();
        for (int i = 0; i < NUM_TEMPS; i++) {
            if (!isnan(g_temp_c[i]))
                temps.add((int)g_temp_c[i]);
            else
                temps.add(nullptr);
        }
    }

    // BMS state
    if (g_bms_state.valid) {
        // Raw F106 bitmaps; the dashboard decodes the individual bits. Sent
        // in the minimal (BLE) payload too — the dashboard's BMS State panel
        // reads only these two bytes.
        auto st = doc["bms"]["state"].to<JsonObject>();
        st["byte0"] = g_bms_state.byte0;
        st["byte1"] = g_bms_state.byte1;
    }

    // BMS current limits
    if (g_bms_limit.valid) {
        auto lim = doc["bms"]["limit"].to<JsonObject>();
        addFloat(lim, "discharge_a", g_bms_limit.discharge_a, 2);
        addFloat(lim, "charge_a",    g_bms_limit.charge_a,    2);
        addFloat(lim, "charge_power_extra_w", g_bms_limit.charge_power_extra_w, 0);
        if (!minimal) {
            lim["mode"]  = g_bms_limit.mode;
            lim["byte5"] = g_bms_limit.byte5;
        }
    }

    // Combined fault codes (BMS + Motor Controller)
    auto faults = doc["faults"].to<JsonObject>();
    auto bms_codes = faults["bms"].to<JsonArray>();
    if (g_bms_faults.any_fault) {
        for (int code = 100; code <= 145; code++) {
            if (g_bms_faults.active_codes_mask & (1ULL << (code - 100)))
                bms_codes.add(code);
        }
    }
    auto mc_codes = faults["mc"].to<JsonArray>();
    if (g_dm1.valid && g_dm1.dtc_spn != 0)
        mc_codes.add(g_dm1.dtc_spn);

    // Motor — always emit so motor.alive is the canonical tractor-on signal.
    // FF21CA broadcasts at ~85 Hz; the MC stops within ~1s of key-off. The
    // 500 ms window catches brief key cycles without false-positiving on a
    // single dropped frame. last_seen_ms==0 means FF21CA has never been
    // heard in this boot — explicitly false rather than relying on a
    // millis()-rollover-from-zero accident.
    {
        auto mot = doc["motor"].to<JsonObject>();
        mot["alive"] = g_motor.last_seen_ms != 0
                       && (millis() - g_motor.last_seen_ms) < 500;
        if (g_motor.valid) {
            if (!minimal) mot["rpm_signed"] = g_motor.rpm_signed;
            mot["rpm_magnitude"] = g_motor.rpm_magnitude;
            mot["direction"]     = g_motor.direction;
            mot["range"]    = g_motor.range;
            mot["torque_raw"] = g_motor.torque_raw;
            if (g_motor.controller_temp_c != INT8_MIN)
                mot["controller_temp_c"] = g_motor.controller_temp_c;
            if (g_motor.motor_temp_c != INT8_MIN)
                mot["motor_temp_c"] = g_motor.motor_temp_c;
        }
    }

    {
        uint32_t nowms = millis();
        bool mc_alive = g_motor.last_seen_ms != 0
                        && (nowms - g_motor.last_seen_ms) < 500;
        doc["tractor"] = mc_alive ? "on" : "off";
    }

#if defined(HAS_VIN_SENSE)
    if (!isnan(g_vin_v)) {
        doc["vin_v"] = roundf(g_vin_v * 10.0f) / 10.0f;
    }
#endif

    // Charger
    if (g_charger.valid) {
        auto chg = doc["charger"].to<JsonObject>();
        chg["flags"] = g_charger.flags;
        if (!minimal) {
            chg["v_raw"]  = g_charger.v_raw;
            chg["i_raw"]  = g_charger.i_raw;
        }
        addFloat(chg, "voltage_v", g_charger.voltage_v, 2);
        addFloat(chg, "current_a", g_charger.current_a, 1);
    }

    // BMS→charger command
    if (g_chgr_cmd.valid) {
        auto cmd = doc["chgr_cmd"].to<JsonObject>();
        if (!minimal) cmd["enable"] = g_chgr_cmd.enable;
        addFloat(cmd, "voltage_v", g_chgr_cmd.voltage_v, 1);
        addFloat(cmd, "current_a", g_chgr_cmd.current_a, 1);
        if (!minimal && g_chgr_cmd.v_raw) cmd["v_raw"] = g_chgr_cmd.v_raw;
        if (!minimal && g_chgr_cmd.i_raw) cmd["i_raw"] = g_chgr_cmd.i_raw;
    }

    if (!minimal) {
        // Vehicle controller
        if (g_vc_state != 0xFF)
            doc["vc"]["state"] = g_vc_state;

        // Dashboard
        if (g_dash_alive != 0xFF)
            doc["dash"]["alive"] = g_dash_alive;

        // DM1 (raw FMI/OC/CM and lamp bytes — fault code is also in faults.mc)
        if (g_dm1.valid) {
            auto dm1 = doc["dm1"].to<JsonObject>();
            dm1["lamp_byte0"] = g_dm1.lamp_byte0;
            dm1["lamp_byte1"] = g_dm1.lamp_byte1;
            dm1["dtc_spn"]    = g_dm1.dtc_spn;
            dm1["dtc_fmi"]    = g_dm1.dtc_fmi;
            dm1["dtc_cm"]     = g_dm1.dtc_cm;
            dm1["dtc_oc"]     = g_dm1.dtc_oc;
        }
    }

    String out;
    if (pretty) serializeJsonPretty(doc, out);
    else        serializeJson(doc, out);
    return out;
}

// ── HTTP handlers ─────────────────────────────────────────────────────────────

void handleJson() {
    server.send(200, "application/json", buildJson());
}

// Names for the STA disconnect reasons that come up when a credentials build
// goes wrong: auth_fail / handshake_timeout usually mean a wrong password,
// no_ap_found a wrong SSID or out-of-range network. Rare codes stay numeric.
static String staDisconnectReasonName(uint8_t reason) {
    switch (reason) {
        case WIFI_REASON_UNSPECIFIED:                return "unspecified";
        case WIFI_REASON_AUTH_EXPIRE:                return "auth_expire";
        case WIFI_REASON_AUTH_LEAVE:                 return "auth_leave";
        case WIFI_REASON_ASSOC_EXPIRE:               return "assoc_expire";
        case WIFI_REASON_ASSOC_TOOMANY:              return "assoc_toomany";
        case WIFI_REASON_NOT_AUTHED:                 return "not_authed";
        case WIFI_REASON_NOT_ASSOCED:                return "not_assoced";
        case WIFI_REASON_ASSOC_LEAVE:                return "assoc_leave";
        case WIFI_REASON_MIC_FAILURE:                return "mic_failure";
        case WIFI_REASON_4WAY_HANDSHAKE_TIMEOUT:     return "4way_handshake_timeout";
        case WIFI_REASON_GROUP_KEY_UPDATE_TIMEOUT:   return "group_key_update_timeout";
        case WIFI_REASON_802_1X_AUTH_FAILED:         return "802_1x_auth_failed";
        case WIFI_REASON_BEACON_TIMEOUT:             return "beacon_timeout";
        case WIFI_REASON_NO_AP_FOUND:                return "no_ap_found";
        case WIFI_REASON_AUTH_FAIL:                  return "auth_fail";
        case WIFI_REASON_ASSOC_FAIL:                 return "assoc_fail";
        case WIFI_REASON_HANDSHAKE_TIMEOUT:          return "handshake_timeout";
        case WIFI_REASON_CONNECTION_FAIL:            return "connection_fail";
        case WIFI_REASON_AP_TSF_RESET:               return "ap_tsf_reset";
        case WIFI_REASON_ROAMING:                    return "roaming";
        default:                                     return String(reason);
    }
}

// Build + WiFi diagnostics, deliberately separate from the /json telemetry:
// this reports what was baked into the binary and how the home-network join
// is going. The soft-AP is always up, so /config stays reachable at
// 192.168.4.1 even when the STA join failed — one request distinguishes
// "wrong password" from "wrong SSID" from "built with empty credentials".
void handleConfig() {
    JsonDocument doc;

    doc["uptime"] = millis() / 1000.0;
#ifdef GIT_SHA
    doc["version"] = GIT_SHA;
#endif
#if defined(BOARD_ADAFRUIT_FEATHER_S3)
    doc["board"] = "adafruit_feather_s3";
#elif defined(BOARD_LILYGO_T2CAN)
    doc["board"] = "lilygo_t2can";
#elif defined(BOARD_REJSACAN)
    doc["board"] = "rejsacan";
#endif
    doc["mdns"] = MDNS_NAME;

